---
kind: type
id: T:Autodesk.Revit.DB.Structure.FabricSheet
source: html/1f420619-ab30-942a-e5b6-028b7ff3889f.htm
---
# Autodesk.Revit.DB.Structure.FabricSheet

An object that represents an Fabric Sheet Element within the Autodesk Revit project.

## Syntax (C#)
```csharp
public class FabricSheet : Element
```

## Remarks
Beginning with Revit 2016, fabric sheets can be either flat or bent.
 Both kinds of fabric sheets are implemented by this FabricSheet class.
 Fabric sheets are created as either flat or bent. Once created, the kind of a fabric sheet cannot be changed.
 The Fabric Sheet element is available only in the Autodesk Revit Structure product.